# Cleaning & Transforming Data with Pandas

## Northwind Traders dataset (small subset)

---

In [1]:
import pandas as pd

# Read xlsx data into new dataframe
original_df = pd.read_excel("https://github.com/valeriemagalong/Val-Practices-Python/raw/main/Northwind_Pandas/Northwind_products_suppliers.xlsx")

# Make copy of original_df for later transformation
nw_df = original_df.copy()

___

### 1. What data is in the first 4 rows?

In [2]:
nw_df.head(4)

,product_id,product_name,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued,category_name,company_name,country,website
0,1,Chai,10 boxes x 30 bags,18.0,39,0,10.0,1,Beverages,"Specialty Biscuits, Ltd.",UK,/
1,2,Chang,24 - 12 oz bottles,19.0,17,40,25.0,1,Beverages,Exotic Liquids,UK,NaN
2,2,Chang,24 - 12 oz bottles,19.0,17,40,25.0,1,Beverages,Exotic Liquids,UK,NaN
3,3,Aniseed Syrup,12 - 550 ml bottles,10.0,13,70,25.0,0,Condiments,Exotic Liquids,UK,""""""

___

### 2. Calculate how many rows and columns are in this file.

In [3]:
df_rows = nw_df.index.size
df_columns = nw_df.columns.size

print(f"There are {df_rows} rows in the Northwind dataframe.")
print(f"There are {df_columns} columns in the Northwind dataframe.")

There are 78 rows in the Northwind dataframe.
There are 12 columns in the Northwind dataframe.

In [4]:
# Double check using the info method
nw_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   product_id         78 non-null     int64
 1   product_name       78 non-null     object
 2   quantity_per_unit  78 non-null     object
 3   unit_price         78 non-null     float64
 4   units_in_stock     78 non-null     int64
 5   units_on_order     78 non-null     int64
 6   reorder_level      76 non-null     float64
 7   discontinued       78 non-null     int64
 8   category_name      78 non-null     object
 9   company_name       78 non-null     object
 10  country            78 non-null     object
 11  website            6 non-null      object
dtypes: float64(2), int64(4), object(6)
memory usage: 7.4+ KB

___

### 3. Whatâ€™s the maximum unit_price?

In [5]:
max_unit_price = nw_df['unit_price'].max()

print(f"The maximum value in the unit_price column is: ${max_unit_price}")

The maximum value in the unit_price column is: $263.5

In [6]:
# Alternative solution
nw_df.describe().loc['max', 'unit_price']

263.5

___

### 4. Use describe() to get the descriptive statistics for this file.

In [7]:
nw_df.describe()

,product_id,unit_price,units_in_stock,units_on_order,reorder_level,discontinued
count,78.000000,78.000000,78.000000,78.000000,76.000000,78.000000
mean,38.525641,28.707821,40.205128,10.512821,12.631579,0.141026
std,22.617499,33.627362,36.010229,23.237757,10.907908,0.350301
min,1.000000,2.500000,0.000000,0.000000,0.000000,0.000000
25%,19.250000,13.062500,15.000000,0.000000,0.000000,0.000000
50%,38.500000,19.475000,26.000000,0.000000,12.500000,0.000000
75%,57.750000,33.137500,60.000000,0.000000,25.000000,0.000000
max,77.000000,263.500000,125.000000,100.000000,30.000000,1.000000

___

### 5. Replace any NULL values in reorder_level with 0.

In [8]:
# Find all rows where there are NaN values in reorder_level
nw_df.loc[nw_df['reorder_level'].isnull()]

,product_id,product_name,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued,category_name,company_name,country,website
6,6,Grandma's Boysenberry Spread,12 - 8 oz jars,25.0,120,0,NaN,0,Condiments,Grandma Kelly's Homestead,USA,2ww
24,71,Flotemysost,10 - 500 g pkgs.,21.5,26,0,NaN,0,Dairy Products,Norske Meierier,Norway,W

In [9]:
# Count the total NaN values in reorder_level
total_nulls_in_reorder_level = nw_df['reorder_level'].isnull().sum()

print(f"The current number of nulls in reorder_level is: {total_nulls_in_reorder_level}")

The current number of nulls in reorder_level is: 2

In [10]:
# Replace the two NaN values in reorder_level with 0 and assign to Series reorder_level_no_nulls
reorder_level_no_nulls = nw_df['reorder_level'].fillna(0)

# Reassign reorder_level to reorder_level_no_nulls
nw_df['reorder_level'] = reorder_level_no_nulls

# When we look again for any null values in reorder_level, nothing is returned
nw_df.loc[nw_df['reorder_level'].isnull()]

Empty DataFrame
Columns: [product_id, product_name, quantity_per_unit, unit_price, units_in_stock, units_on_order, reorder_level, discontinued, category_name, company_name, country, website]
Index: []

In [11]:
# Count the total NaN values in reorder_level to double check that there are no nulls
total_nulls_in_reorder_level = nw_df['reorder_level'].isnull().sum()

print(f"The number of nulls in reorder_level is now: {total_nulls_in_reorder_level}")

The number of nulls in reorder_level is now: 0

___

### 6. Remove duplicate rows.

In [12]:
# Find any duplicated rows
nw_df.loc[nw_df.duplicated()]

,product_id,product_name,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued,category_name,company_name,country,website
2,2,Chang,24 - 12 oz bottles,19.0,17,40,25.0,1,Beverages,Exotic Liquids,UK,NaN

In [13]:
# Declare new dataframe nw_df_transformed_1 with duplicate rows dropped
nw_df_transformed_1 = nw_df.drop_duplicates()

# No duplicated rows are returned from nw_df_transformed_1, so the duplicate rows were successfully removed
nw_df_transformed_1.loc[nw_df_transformed_1.duplicated()]

Empty DataFrame
Columns: [product_id, product_name, quantity_per_unit, unit_price, units_in_stock, units_on_order, reorder_level, discontinued, category_name, company_name, country, website]
Index: []

In [14]:
# Count the total duplicates in nw_df_transformed_1 to double check that there are no duplicates
total_duplicates = nw_df_transformed_1.loc[nw_df_transformed_1.duplicated()].sum().sum()

print(f"The number of duplicates in the dataframe is now: {total_duplicates}")

The number of duplicates in the dataframe is now: 0.0

___

### 7. Change "Gustaf's KnâˆšÂ§ckebrâˆšâˆ‚d" To "Gustaf's KnÃ¤ckebrÃ¶d".

In [15]:
# Find "Gustaf's KnâˆšÂ§ckebrâˆšâˆ‚d" values in the dataframe
nw_df_transformed_1.loc[nw_df_transformed_1['product_name'] == "Gustaf's KnâˆšÂ§ckebrâˆšâˆ‚d"]

,product_id,product_name,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued,category_name,company_name,country,website
37,22,Gustaf's KnâˆšÂ§ckebrâˆšâˆ‚d,24 - 500 g pkgs.,21.0,104,0,25.0,0,Grains/Cereals,PB KnâˆšÂ§ckebrâˆšâˆ‚d AB,Sweden,NaN

In [16]:
# Replace "Gustaf's KnâˆšÂ§ckebrâˆšâˆ‚d" values with "Gustaf's KnÃ¤ckebrÃ¶d"
# Declare new dataframe nw_df_transformed_2 that contains replaced values
nw_df_transformed_2 = nw_df_transformed_1.replace("Gustaf's KnâˆšÂ§ckebrâˆšâˆ‚d", "Gustaf's KnÃ¤ckebrÃ¶d")

# Find "Gustaf's KnÃ¤ckebrÃ¶d" in the nw_df_transformed_2 to confirm replacement was made
nw_df_transformed_2.loc[nw_df_transformed_2['product_name'] == "Gustaf's KnÃ¤ckebrÃ¶d"]

,product_id,product_name,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued,category_name,company_name,country,website
37,22,Gustaf's KnÃ¤ckebrÃ¶d,24 - 500 g pkgs.,21.0,104,0,25.0,0,Grains/Cereals,PB KnâˆšÂ§ckebrâˆšâˆ‚d AB,Sweden,NaN

---

### 8. Remove the column for website.

In [17]:
# Declare new dataframe nw_df_transformed_3 where website column is dropped
nw_df_transformed_3 = nw_df_transformed_2.drop('website', axis = 1)

# Check columns in nw_df_transformed_3 to make sure there is no website column
nw_df_transformed_3.columns

Index(['product_id', 'product_name', 'quantity_per_unit', 'unit_price',
       'units_in_stock', 'units_on_order', 'reorder_level', 'discontinued',
       'category_name', 'company_name', 'country'],
      dtype='object')

---

### 9. Create a crosstab, with category_name in rows and country in columns.

In [18]:
pd.crosstab(nw_df_transformed_3['category_name'], nw_df_transformed_3['country'])

country,Australia,Brazil,Canada,Denmark,Finland,France,Germany,Italy,Japan,Netherlands,Norway,Singapore,Spain,Sweden,UK,USA
category_name,,,,,,,,,,,,,,,,
Beverages,1,1,0,0,1,2,1,0,0,0,0,1,0,0,2,3
Condiments,1,0,1,0,0,0,1,0,1,0,0,1,0,0,1,6
Confections,1,0,1,0,2,0,3,0,0,2,0,0,0,0,4,0
Dairy Products,0,0,0,0,0,2,0,3,0,0,3,0,2,0,0,0
Grains/Cereals,1,0,0,0,0,0,1,2,0,0,0,1,0,2,0,0
Meat/Poultry,2,0,2,0,0,0,1,0,1,0,0,0,0,0,0,0
Produce,1,0,0,0,0,0,1,0,2,0,0,0,0,0,0,1
Seafood,1,0,0,2,0,1,1,0,2,0,0,0,0,3,0,2

---

### 10. Create a pivot table with average unit_price by category.

In [19]:
# Default aggregate function for the pivot_table method is mean
nw_df_transformed_3.pivot_table('unit_price', index = 'category_name')

                unit_price
category_name
Beverages        37.979167
Condiments       22.854167
Confections      25.160000
Dairy Products   28.730000
Grains/Cereals   20.250000
Meat/Poultry     54.006667
Produce          32.370000
Seafood          20.682500

---

### 11. Create a pivot table with average reorder_level  by category (rows) and country (columns).

In [20]:
# Default aggregate function for the pivot_table method is mean
nw_df_transformed_3.pivot_table('reorder_level', index = 'category_name', columns = 'country')

country,Australia,Brazil,Canada,Denmark,Finland,France,Germany,Italy,Japan,Netherlands,Norway,Singapore,Spain,Sweden,UK,USA
category_name,,,,,,,,,,,,,,,,
Beverages,30.0,0.0,NaN,NaN,20.0,10.0,25.0,NaN,NaN,NaN,NaN,25.0,NaN,NaN,17.50,13.333333
Condiments,5.0,NaN,25.0,NaN,NaN,NaN,15.0,NaN,5.0,NaN,NaN,15.0,NaN,NaN,25.00,3.333333
Confections,10.0,NaN,0.0,NaN,22.5,NaN,20.0,NaN,NaN,12.5,NaN,NaN,NaN,NaN,6.25,NaN
Dairy Products,NaN,NaN,NaN,NaN,NaN,0.0,NaN,15.0,NaN,NaN,11.666667,NaN,15.0,NaN,NaN,NaN
Grains/Cereals,25.0,NaN,NaN,NaN,NaN,NaN,30.0,25.0,NaN,NaN,NaN,0.0,NaN,25.000000,NaN,NaN
Meat/Poultry,0.0,NaN,15.0,NaN,NaN,NaN,0.0,NaN,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Produce,10.0,NaN,NaN,NaN,NaN,NaN,0.0,NaN,2.5,NaN,NaN,NaN,NaN,NaN,NaN,10.000000
Seafood,0.0,NaN,NaN,7.5,NaN,20.0,15.0,NaN,2.5,NaN,NaN,NaN,NaN,16.666667,NaN,20.000000

---

### 12. Create a groupby table with sum of discontinued products by company name.

In [21]:
# Declare groupby dataframe company_groups where groups are determined by company_name
company_groups = nw_df_transformed_3.groupby('company_name')

# Sum the values in discontinued by groups
company_groups['discontinued'].sum()

company_name
Aux joyeux ecclâˆšÂ©siastiques               0
Bigfoot Breweries                         0
Cooperativa de Quesos 'Las Cabras'        0
Escargots Nouveaux                        0
Exotic Liquids                            1
Formaggi Fortini s.r.l.                   0
Forâˆšâ„¢ts d'âˆšÂ©rables                        0
G'day, Mate                               1
Gai pâˆšÂ¢turage                             0
Grandma Kelly's Homestead                 0
Heli SâˆšÂºâˆšÃ¼waren GmbH & Co. KG             0
Karkki Oy                                 0
Leka Trading                              1
Lyngbysild                                0
Ma Maison                                 0
Mayumi's                                  0
New England Seafood Cannery               0
New Orleans Cajun Delights                1
Nord-Ost-Fisch Handelsgesellschaft mbH    0
Norske Meierier                           0
PB KnâˆšÂ§ckebrâˆšâˆ‚d AB                        0
Pasta Buttini s.r.l.                      0
Pavlova, Ltd.                             1
Plutzer LebensmittelgroâˆšÃ¼mâˆšÂ§rkte AG       2
Refrescos Americanas LTDA                 1
Specialty Biscuits, Ltd.                  1
Svensk Sjâˆšâˆ‚fâˆšâˆ‚da AB                       0
Tokyo Traders                             1
Zaanse Snoepfabriek                       0
Name: discontinued, dtype: int64

---

### 13. Create a groupby table with maximum unit_price by country and category (both in rows).

In [22]:
# Declare groupby dataframe country_category_groups
country_category_groups = nw_df_transformed_3.groupby(['country', 'category_name'])

# Find the max unit_price by groups
country_category_groups['unit_price'].max()

country      category_name
Australia    Beverages          15.00
             Condiments         43.90
             Confections        17.45
             Grains/Cereals      7.00
             Meat/Poultry       39.00
             Produce            53.00
             Seafood            62.50
Brazil       Beverages           4.50
Canada       Condiments         28.50
             Confections        49.30
             Meat/Poultry       24.00
Denmark      Seafood            12.00
Finland      Beverages          18.00
             Confections        20.00
France       Beverages         263.50
             Dairy Products     55.00
             Seafood            13.25
Germany      Beverages           7.75
             Condiments         13.00
             Confections        43.90
             Grains/Cereals     33.25
             Meat/Poultry      123.79
             Produce            45.60
             Seafood            25.89
Italy        Dairy Products     34.80
             Grains/Cereals     38.00
Japan        Condiments         13.00
             Meat/Poultry       97.00
             Produce            23.25
             Seafood            31.00
Netherlands  Confections        12.75
Norway       Dairy Products     36.00
Singapore    Beverages          46.00
             Condiments         19.45
             Grains/Cereals     14.00
Spain        Dairy Products     38.00
Sweden       Grains/Cereals     21.00
             Seafood            26.00
UK           Beverages          19.00
             Condiments         10.00
             Confections        81.00
USA          Beverages          18.00
             Condiments         40.00
             Produce            30.00
             Seafood            18.40
Name: unit_price, dtype: float64

---